# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\lucasiversen\Desktop\3semesterProjekt_repository\PSoC kode\NeoPixel\NeoPixel.cydsn\NeoPixel.cyprj
# Date: Mon, 25 Nov 2019 10:17:18 GMT
#set_units -time ns
create_clock -name {CLK_500kHz(routed)} -period 2000 -waveform {0 1000} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 19.6078431372549 -waveform {0 9.80392156862745} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 19.6078431372549 -waveform {0 9.80392156862745} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {CLK_24MHz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {ADC_SAR_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 33 65} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {CLK_500kHz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 103 205} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {soundUART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 665 1329} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {clock_motor} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1021 2041} [list [get_pins {ClockBlock/dclk_glb_4}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\lucasiversen\Desktop\3semesterProjekt_repository\PSoC kode\NeoPixel\NeoPixel.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\lucasiversen\Desktop\3semesterProjekt_repository\PSoC kode\NeoPixel\NeoPixel.cydsn\NeoPixel.cyprj
# Date: Mon, 25 Nov 2019 10:17:04 GMT
