# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Thoma\OneDrive\Skrivebord\EX 6 standard 20160818_1.cydsn\EX 6 standard 20160818_1.cyprj
# Date: Thu, 07 Nov 2019 16:02:10 GMT
#set_units -time ns
create_clock -name {ADC_DelSig_1_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {Mixer_1_aclk(routed)} -period 90916.666666666657 -waveform {0 45458.3333333333} [list [get_pins {ClockBlock/aclk_1}]]
create_clock -name {Clock_1(routed)} -period 90916.666666666657 -waveform {0 45458.3333333333} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_DelSig_1_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_DelSig_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 47 95} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 313 627} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Mixer_1_aclk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2183 4365} -nominal_period 90916.666666666657 [list [get_pins {ClockBlock/aclk_glb_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2183 4365} -nominal_period 90916.666666666657 [list [get_pins {ClockBlock/dclk_glb_2}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Thoma\OneDrive\Skrivebord\EX 6 standard 20160818_1.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Thoma\OneDrive\Skrivebord\EX 6 standard 20160818_1.cydsn\EX 6 standard 20160818_1.cyprj
# Date: Thu, 07 Nov 2019 16:02:04 GMT
